# ğŸ“ ì‹¤ìŠµ ë¬¸ì œ í’€ê¸°
ì´ ë…¸íŠ¸ë¶ì€ ë°°ìš´ ë‚´ìš©ì„ ë³µìŠµí•˜ê³  ì—°ìŠµí•˜ëŠ” ê³µê°„ì´ì—ìš”.
ë¬¸ì œë¥¼ ì½ê³  ì½”ë“œë¥¼ ì§ì ‘ ì‘ì„±í•´ë³´ì„¸ìš”! í™”ì´íŒ…! ğŸ’ª

### **[ì‹¤ìŠµ] ê¸°ë³¸ ì‹¤ìŠµ**

| Name | Age | City | Salary |
| --- | --- | --- | --- |
| Alice | 25 | New York | 70000 |
| Bob | 30 | Los Angeles | 80000 |
| Charlie | 35 | Chicago | 120000 |
| David | 40 | Houston | 90000 |
| Eve | 28 | San Francisco | 75000 |
- ë‹¤ìŒ ë°ì´í„°ë¥¼ í™œìš©í•˜ì—¬ ì‹¤ìŠµ ë¬¸ì œë¥¼ í•´ê²°í•˜ì„¸ìš”.
1. **DataFrameê°ì²´ ìƒì„± :** ìœ„ì˜ ë°ì´í„°ë¥¼ ì‚¬ìš©í•´ DataFrameê°ì²´ë¥¼ ìƒì„±í•˜ì„¸ìš”.

In [4]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame({                               # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    'Salary': [70000, 80000, 120000, 90000, 75000]
})

df

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  120000
3    David   40        Houston   90000
4      Eve   28  San Francisco   75000

2. **ì—´ê³¼ í–‰ ì„ íƒ**
    - `Name`ê³¼ `City` ì—´ì„ ì„ íƒí•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.
    - ë‚˜ì´ê°€ 30 ì´ìƒì¸ í–‰ì„ ì„ íƒí•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.

In [19]:
df[['Name', 'City']]
# ì¡°ê±´ì— ë§ëŠ” ë°ì´í„° í•„í„°ë§
df[df['Age'] >= 30]

      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston   90000

3. **í–‰ê³¼ ì—´ ì¶”ê°€**
    - `Country` ì—´ì„ ì¶”ê°€í•˜ê³ , ëª¨ë‘ 'USA'ë¡œ ì„¤ì •í•˜ì„¸ìš”.
    - ìƒˆë¡œìš´ í–‰ì„ ì¶”ê°€í•˜ì„¸ìš”. (Name: Frank, Age: 33, City: Seattle, Salary: 85000)

In [23]:
df['Contry'] = ['USA', 'USA', 'USA', 'USA', 'USA']
df
# ì¡°ê±´/ë¼ë²¨ ê¸°ë°˜ ë°ì´í„° ì„ íƒ ë° ìˆ˜ì •
df.loc[5] = ['Frank', 33, 'Seattle', 85000, 'USA']  # ì´ë¦„ìœ¼ë¡œ ë°ì´í„° ì„ íƒ
df

      Name  Age           City  Salary Contry
0    Alice   25       New York   70000    USA
1      Bob   30    Los Angeles   80000    USA
2  Charlie   35        Chicago  120000    USA
3    David   40        Houston   90000    USA
4      Eve   28  San Francisco   75000    USA
5    Frank   33        Seattle   85000    USA

4. **ë°ì´í„° ì‚­ì œ**
    - `Salary` ì—´ì„ ì‚­ì œí•˜ì„¸ìš”.
    - 'David'ê°€ ìˆëŠ” í–‰ì„ ì‚­ì œí•˜ì„¸ìš”.

In [29]:
# df = df.drop('Salary', axis=1)
# ë¶ˆí•„ìš”í•œ í–‰/ì—´ ì‚­ì œ
df = df.drop(3)                                   # ì‚­ì œí•˜ê¸°

df

      Name  Age           City Contry
0    Alice   25       New York    USA
1      Bob   30    Los Angeles    USA
2  Charlie   35        Chicago    USA
4      Eve   28  San Francisco    USA
5    Frank   33        Seattle    USA

5. **ë°ì´í„° ìˆ˜ì •**
    - `Age`ê°€ 35 ì´ìƒì¸ ì‚¬ëŒë“¤ì˜ `Salary`ë¥¼ 5% ì¦ê°€ì‹œí‚¤ì„¸ìš”.
    - 'Alice'ì˜ `City`ë¥¼ 'Boston'ìœ¼ë¡œ ìˆ˜ì •í•˜ì„¸ìš”.

In [52]:
# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame({                               # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    'Salary': [70000, 80000, 120000, 90000, 75000]
})

# ì¡°ê±´ì— ë§ëŠ” ë°ì´í„° í•„í„°ë§
df_age35 = df[df['Age'] >= 35]
# ì¡°ê±´/ë¼ë²¨ ê¸°ë°˜ ë°ì´í„° ì„ íƒ ë° ìˆ˜ì •
df.loc[df['Age'] >= 35, 'Salary'] = df['Salary'] * 1.05  # ì´ë¦„ìœ¼ë¡œ ë°ì´í„° ì„ íƒ
# ì¡°ê±´/ë¼ë²¨ ê¸°ë°˜ ë°ì´í„° ì„ íƒ ë° ìˆ˜ì •
df.loc[df['Name'] == 'Alice', 'City'] = 'Boston'  # ì´ë¦„ìœ¼ë¡œ ë°ì´í„° ì„ íƒ

df

      Name  Age           City  Salary
0    Alice   25         Boston   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  126000
3    David   40        Houston   94500
4      Eve   28  San Francisco   75000

6. **ë°ì´í„° íƒ€ì… ë³€í™˜**
    - `Age`ì™€ `Salary`ì˜ ë°ì´í„° íƒ€ì…ì„ floatë¡œ ë³€í™˜í•˜ì„¸ìš”.

### **[ì‹¤ìŠµ 1] ë°ì´í„° ì •ë¦¬ ë° ì „ì²˜ë¦¬**

ë‹¤ìŒì€ ì§ì¥ ë‚´ ì§ì› ë°ì´í„°ì…ë‹ˆë‹¤. ê²°ì¸¡ëœ ê°’ë“¤ì´ í¬í•¨ë˜ì–´ ìˆìŠµë‹ˆë‹¤. `Salary`ì™€ `YearsAtCompany`ì˜ ê²°ì¸¡ê°’ì„ ê° ì—´ì˜ í‰ê· ê°’ìœ¼ë¡œ ì±„ìš°ì„¸ìš”.

```python
employee_data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'IT', 'Marketing', None, 'HR'],
    'Salary': [50000, 70000, None, 45000, 52000],
    'YearsAtCompany': [5, None, 8, 3, 4]
}
```

In [20]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

employee_data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John', 'Emily', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'IT', 'Marketing', None, 'HR'],
    'Salary': [50000, 70000, None, 45000, 52000],
    'YearsAtCompany': [5, None, 8, 3, 4]
}

# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame(employee_data)                  # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±

# ê²°ì¸¡ê°’(NaN) ëŒ€ì²´
df['Salary'].fillna(df['Salary'].mean(), inplace=True)  # í‰ê·  ê³„ì‚°
# ê²°ì¸¡ê°’(NaN) ëŒ€ì²´
df['YearsAtCompany'].fillna(df['YearsAtCompany'].mean(), inplace=True)  # í‰ê·  ê³„ì‚°

df

/var/folders/51/k_yn4qxs0_nfrm1hk39_0m2r0000gn/T/ipykernel_20352/1892410554.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)
/var/folders/51/k_yn4qxs0_nfrm1hk39_0m2r0000gn/T/ipykernel_20352/1892410554.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['YearsAtCompany'].fillna(df['YearsAtCompany'].mean(), inplace=True)

   EmployeeID   Name Department   Salary  YearsAtCompany
0         101   John         HR  50000.0             5.0
1         102  Emily         IT  70000.0             5.0
2         103   Sara  Marketing  54250.0             8.0
3         104    Tom       None  45000.0             3.0
4         105   Anna         HR  52000.0             4.0

### [ì‹¤ìŠµ 2] **ì¤‘ë³µê°’ ì œê±°**

ë‹¤ìŒì€ í•œ íŒë§¤ì ì˜ ì œí’ˆ íŒë§¤ ê¸°ë¡ì…ë‹ˆë‹¤. ë™ì¼í•œ ì œí’ˆì´ ì¤‘ë³µìœ¼ë¡œ ê¸°ë¡ë˜ì–´ ìˆìŠµë‹ˆë‹¤. ì¤‘ë³µëœ `ProductID`ë¥¼ ê°€ì§„ ì œí’ˆì˜ ì¤‘ë³µëœ í–‰ì„ ì œê±°í•œ í›„, ê°€ì¥ ì €ë ´í•œ ê°€ê²©ì„ ê°€ì§„ ë°ì´í„°ë§Œ ë‚¨ê¸°ì„¸ìš”.

```python
product_data = {
    'ProductID': [1, 2, 3, 1, 4, 2],
    'ProductName': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Keyboard', 'Mouse'],
    'Price': [1200, 25, 300, 1150, 45, 22],
    'QuantitySold': [10, 100, 50, 8, 70, 120]
}
```

In [21]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

product_data = {
    'ProductID': [1, 2, 3, 1, 4, 2],
    'ProductName': ['Laptop', 'Mouse', 'Monitor', 'Laptop', 'Keyboard', 'Mouse'],
    'Price': [1200, 25, 300, 1150, 45, 22],
    'QuantitySold': [10, 100, 50, 8, 70, 120]
}

# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame(product_data)                   # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±

# 1. ê°€ê²©(Price)ì„ ê¸°ì¤€ìœ¼ë¡œ ì˜¤ë¦„ì°¨ìˆœ ì •ë ¬
# (ì´ë ‡ê²Œ í•˜ë©´ ê°™ì€ ProductID ì¤‘ì—ì„œ ê°€ê²©ì´ ë‚®ì€ í•­ëª©ì´ ë¦¬ìŠ¤íŠ¸ì˜ ìœ„ìª½ìœ¼ë¡œ ì˜¤ê²Œ ë©ë‹ˆë‹¤)
# ë°ì´í„° ì •ë ¬
df_sorted = df.sort_values(by='Price', ascending=True)  # ê°’ ì •ë ¬í•˜ê¸°

# 2. ProductIDë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì¤‘ë³µ ì œê±°
# keep='first' ì˜µì…˜ì€ ì¤‘ë³µëœ ê°’ ì¤‘ ê°€ì¥ ìœ„ì— ìˆëŠ” ì²« ë²ˆì§¸ ê°’(ì•„ê¹Œ ì •ë ¬í•œ ìµœì €ê°€ í•­ëª©)ì„ ë‚¨ê¹ë‹ˆë‹¤.
# ì¤‘ë³µê°’ ì œê±°
df_result = df_sorted.drop_duplicates(subset='ProductID', keep='first')  # ì‚­ì œí•˜ê¸°

# 3. ì¸ë±ìŠ¤ ì¬ì„¤ì • (ê¹”ë”í•œ ì¶œë ¥ì„ ìœ„í•´ ê¸°ì¡´ ì¸ë±ìŠ¤ë¥¼ ë²„ë¦¬ê³  ìƒˆë¡œ ë§¤ê¹ë‹ˆë‹¤)
# ì¸ë±ìŠ¤ ì´ˆê¸°í™”
df_result = df_result.reset_index(drop=True)      # ì¸ë±ìŠ¤ í™•ì¸

# ê²°ê³¼ í™•ì¸
print(df_result)

   ProductID ProductName  Price  QuantitySold
0          2       Mouse     22           120
1          4    Keyboard     45            70
2          3     Monitor    300            50
3          1      Laptop   1150             8

### [ì‹¤ìŠµ 3] **ë°ì´í„° ì •ë ¬**

ë‹¤ìŒì€ ìë™ì°¨ ëª¨ë¸ë³„ ì„±ëŠ¥ ë°ì´í„°ë¥¼ í¬í•¨í•˜ê³  ìˆìŠµë‹ˆë‹¤. `ë§ˆë ¥(horsepower)`ì„ ê¸°ì¤€ìœ¼ë¡œ ì˜¤ë¦„ì°¨ìˆœìœ¼ë¡œ ë°ì´í„°ë¥¼ ì •ë ¬í•œ í›„, `ì—°ë¹„(mpg)`ê°€ ë†’ì€ ìƒìœ„ 3ê°œ ìë™ì°¨ë§Œ ì¶œë ¥í•˜ì„¸ìš”.

```python
car_data = {
    'Model': ['Sedan', 'SUV', 'Truck', 'Coupe', 'Convertible'],
    'Horsepower': [180, 250, 200, 170, 150],
    'MPG': [30, 20, 15, 35, 28],
    'Price': [30000, 45000, 40000, 28000, 32000]
}
```

In [33]:
car_data = {
    'Model': ['Sedan', 'SUV', 'Truck', 'Coupe', 'Convertible'],
    'Horsepower': [180, 250, 200, 170, 150],
    'MPG': [30, 20, 15, 35, 28],
    'Price': [30000, 45000, 40000, 28000, 32000]
}

# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame(car_data)                       # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±
# ë°ì´í„° ì •ë ¬
df_sorted = df.sort_values(by='Horsepower').nlargest(3, 'MPG')  # ê°’ ì •ë ¬í•˜ê¸°
print(df_sorted)

         Model  Horsepower  MPG  Price
3        Coupe         170   35  28000
0        Sedan         180   30  30000
4  Convertible         150   28  32000

### [ì‹¤ìŠµ 4] **ë°ì´í„° í•„í„°ë§**

ë‹¤ìŒì€ ì¶•êµ¬ ì„ ìˆ˜ë“¤ì˜ ë°ì´í„°ë¥¼ ë‚˜íƒ€ëƒ…ë‹ˆë‹¤. í•„í„°ë§ì„ í†µí•´ í¬ì§€ì…˜ì´ "Forward"ì´ê³ , ë‚˜ì´ê°€ 30 ì´í•˜ì¸ ì„ ìˆ˜ë§Œ ì¶œë ¥í•˜ì„¸ìš”.

```python
football_data = {
    'PlayerID': [201, 202, 203, 204, 205],
    'Name': ['Ronaldo', 'Messi', 'Neymar', 'Mbappe', 'Kane'],
    'Position': ['Forward', 'Forward', 'Midfielder', 'Forward', 'Forward'],
    'GoalsScored': [600, 700, 400, 150, 200],
    'Age': [35, 33, 29, 22, 27]
}
```

In [38]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

football_data = {
    'PlayerID': [201, 202, 203, 204, 205],
    'Name': ['Ronaldo', 'Messi', 'Neymar', 'Mbappe', 'Kane'],
    'Position': ['Forward', 'Forward', 'Midfielder', 'Forward', 'Forward'],
    'GoalsScored': [600, 700, 400, 150, 200],
    'Age': [35, 33, 29, 22, 27]
}

# DataFrame ìƒì„±
# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame(football_data)                  # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±

# ë°ì´í„° í•„í„°ë§ ì¡°ê±´ ì„¤ì •
# 1. Position ì»¬ëŸ¼ì˜ ê°’ì´ 'Forward' ì¸ ê²½ìš°
# 2. Age ì»¬ëŸ¼ì˜ ê°’ì´ 30 ì´í•˜(<=) ì¸ ê²½ìš°
# ë‘ ì¡°ê±´ì„ ëª¨ë‘ ë§Œì¡±í•´ì•¼ í•˜ë¯€ë¡œ AND ì—°ì‚°ì(&)ë¥¼ ì‚¬ìš©í•©ë‹ˆë‹¤.
# (Pandas ì¡°ê±´ë¬¸ì—ì„œëŠ” ê´„í˜¸ë¡œ ê° ì¡°ê±´ì„ ë¬¶ì–´ì£¼ëŠ” ê²ƒì´ ì¤‘ìš”í•©ë‹ˆë‹¤)
# ì¡°ê±´ì— ë§ëŠ” ë°ì´í„° í•„í„°ë§
filtered_result = df[ (df['Position'] == 'Forward') & (df['Age'] <= 30) ]

# ê²°ê³¼ ì¶œë ¥
print(filtered_result)

   PlayerID    Name Position  GoalsScored  Age
3       204  Mbappe  Forward          150   22
4       205    Kane  Forward          200   27

## **[ì¢…í•© ì‹¤ìŠµ 1] ìƒí’ˆ íŒë§¤ ë°ì´í„° ë¶„ì„**

ë‹¤ìŒì€ í•œ ì „ììƒê±°ë˜ ì‚¬ì´íŠ¸ì˜ **ìƒí’ˆ íŒë§¤ ë°ì´í„°**ì…ë‹ˆë‹¤. ê³ ê°ë“¤ì´ íŠ¹ì • ìƒí’ˆì„ êµ¬ë§¤í•œ ê¸°ë¡ì´ í¬í•¨ë˜ì–´ ìˆìŠµë‹ˆë‹¤. ë°ì´í„°ë¥¼ í™œìš©í•˜ì—¬ ì•„ë˜ì˜ ë¬¸ì œë¥¼ í•´ê²°í•˜ì„¸ìš”.

In [75]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

# ì˜ˆì‹œ ìƒí’ˆ íŒë§¤ ë°ì´í„°
sales_data = {
    'OrderID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Product': ['Laptop', 'Mouse', 'Laptop', 'Monitor', 'Mouse', 'Keyboard', 'Laptop', 'Mouse', 'Monitor', 'Keyboard'],
    'Quantity': [1, 2, 1, 1, 2, 1, 1, 3, 1, 1],
    'Price': [1200, 25, 1200, 300, 25, 100, 1200, 25, 300, 100],
    'CustomerID': [1001, 1002, 1001, 1003, 1004, 1002, 1001, 1003, 1005, 1002],
    'OrderDate': ['2024-01-05', '2024-01-06', '2024-01-07', '2024-01-10', '2024-01-12', '2024-01-15', '2024-01-18', '2024-01-20', '2024-01-22', '2024-01-25']
}
# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df_sales = pd.DataFrame(sales_data)               # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±

   OrderID   Product  Quantity  Price  CustomerID   OrderDate
0      101    Laptop         1   1200        1001  2024-01-05
1      102     Mouse         2     25        1002  2024-01-06
2      103    Laptop         1   1200        1001  2024-01-07
3      104   Monitor         1    300        1003  2024-01-10
4      105     Mouse         2     25        1004  2024-01-12
5      106  Keyboard         1    100        1002  2024-01-15
6      107    Laptop         1   1200        1001  2024-01-18
7      108     Mouse         3     25        1003  2024-01-20
8      109   Monitor         1    300        1005  2024-01-22
9      110  Keyboard         1    100        1002  2024-01-25

1. ê° ê³ ê°(`CustomerID`)ë³„ë¡œ ì´ êµ¬ë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•˜ì„¸ìš”.
2. `Laptop`ì„ êµ¬ë§¤í•œ ê³ ê°ë“¤ì˜ í‰ê·  êµ¬ë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•˜ì„¸ìš”.
3. ê°€ì¥ ë§ì´ íŒë§¤ëœ ìƒí’ˆ(ìƒí’ˆ ì´ë¦„ê³¼ íŒë§¤ëœ ì´ ìˆ˜ëŸ‰)ì„ êµ¬í•˜ì„¸ìš”.
4. `OrderDate`ê°€ 2024ë…„ 1ì›” 10ì¼ ì´í›„ì¸ ì£¼ë¬¸ë§Œ í•„í„°ë§í•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.
5. `Product`ë³„ë¡œ íŒë§¤ëŸ‰ê³¼ ì´ íŒë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•œ í›„, ì´ë¥¼ `Price` ê¸°ì¤€ìœ¼ë¡œ ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬í•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.

In [87]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd
# ë°ì´í„°
sales_data = {
    'OrderID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Product': ['Laptop', 'Mouse', 'Laptop', 'Monitor', 'Mouse', 'Keyboard', 'Laptop', 'Mouse', 'Monitor', 'Keyboard'],
    'Quantity': [1, 2, 1, 1, 2, 1, 1, 3, 1, 1],
    'Price': [1200, 25, 1200, 300, 25, 100, 1200, 25, 300, 100],
    'CustomerID': [1001, 1002, 1001, 1003, 1004, 1002, 1001, 1003, 1005, 1002],
    'OrderDate': ['2024-01-05', '2024-01-06', '2024-01-07', '2024-01-10', '2024-01-12', '2024-01-15', '2024-01-18', '2024-01-20', '2024-01-22', '2024-01-25']
}

# DataFrame ìƒì„±
# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df_sales = pd.DataFrame(sales_data)               # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±

# 'OrderDate'ë¥¼ ë‚ ì§œ í˜•ì‹ìœ¼ë¡œ ë³€í™˜ (ë¬¸ìì—´ -> datetime)
df_sales['OrderDate'] = pd.to_datetime(df_sales['OrderDate'])

In [92]:
# 1. ê° ê³ ê°(CustomerID)ë³„ë¡œ ì´ êµ¬ë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•˜ì„¸ìš”.
df_sales['TotalAmount'] = df_sales['Price'] * df_sales['Quantity']
# ë°ì´í„° ê·¸ë£¹í™” ë° ì§‘ê³„
customer_total = df_sales.groupby('CustomerID')['TotalAmount'].sum()  # í•©ê³„ ê³„ì‚°

customer_total

CustomerID
1001    3600
1002     250
1003     375
1004      50
1005     300
Name: TotalAmount, dtype: int64

In [93]:
# ë‹¨ê³„ 1: ê° ì£¼ë¬¸ ê±´ë³„ 'ì´ ê¸ˆì•¡(TotalAmount)' ê³„ì‚°
# (ê°œë³„ ë‹¨ê°€ Price * ìˆ˜ëŸ‰ Quantity)ì„ ê³±í•´ì„œ ìƒˆë¡œìš´ ì»¬ëŸ¼ìœ¼ë¡œ ë§Œë“­ë‹ˆë‹¤.
df_sales['TotalAmount'] = df_sales['Price'] * df_sales['Quantity']

# ë‹¨ê³„ 2: ê³ ê°ë³„(CustomerID)ë¡œ ê·¸ë£¹í™”(groupby)í•˜ì—¬ ì´ ê¸ˆì•¡ì˜ í•©(sum) ì§‘ê³„
# ë°ì´í„° ê·¸ë£¹í™” ë° ì§‘ê³„
customer_total = df_sales.groupby('CustomerID')['TotalAmount'].sum()  # í•©ê³„ ê³„ì‚°

# ë‹¨ê³„ 3: ë³´ê¸° ì¢‹ê²Œ ê²°ê³¼ ì¸ë±ìŠ¤ ë¦¬ì…‹ (ì„ íƒ ì‚¬í•­)
# ì¸ë±ìŠ¤ ì´ˆê¸°í™”
customer_total_df = customer_total.reset_index()  # ì¸ë±ìŠ¤ í™•ì¸

print("== ê³ ê°ë³„ ì´ êµ¬ë§¤ ê¸ˆì•¡ ==")
print(customer_total_df)

== ê³ ê°ë³„ ì´ êµ¬ë§¤ ê¸ˆì•¡ ==
   CustomerID  TotalAmount
0        1001         3600
1        1002          250
2        1003          375
3        1004           50
4        1005          300

In [81]:
# ------------------------------------------------------------------------------------------------
# 2. `Laptop`ì„ êµ¬ë§¤í•œ ê³ ê°ë“¤ì˜ í‰ê·  êµ¬ë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•˜ì„¸ìš”.
# ------------------------------------------------------------------------------------------------

# ë‹¨ê³„ 1: 'Laptop'ì„ êµ¬ë§¤í•œ ë°ì´í„°ë§Œ í•„í„°ë§
laptop_sales = df_sales[df_sales['Product'] == 'Laptop']

# ë‹¨ê³„ 2: Laptop êµ¬ë§¤ ê³ ê° ì§‘ë‹¨ì˜ 'TotalAmount' í‰ê·  ê³„ì‚°
laptop_avg_amount = laptop_sales['TotalAmount'].mean()  # í‰ê·  ê³„ì‚°

print(f"\n== Laptop êµ¬ë§¤ ê³ ê° í‰ê·  êµ¬ë§¤ì•¡: {laptop_avg_amount:.2f} ==")

== Laptop êµ¬ë§¤ ê³ ê° í‰ê·  êµ¬ë§¤ì•¡: 1200.00 ==

In [82]:
# ------------------------------------------------------------------------------------------------
# 3. ê°€ì¥ ë§ì´ íŒë§¤ëœ ìƒí’ˆ(ìƒí’ˆ ì´ë¦„ê³¼ íŒë§¤ëœ ì´ ìˆ˜ëŸ‰)ì„ êµ¬í•˜ì„¸ìš”.
# ------------------------------------------------------------------------------------------------

# ë‹¨ê³„ 1: ìƒí’ˆë³„(Product) íŒë§¤ ìˆ˜ëŸ‰(Quantity) í•©ê³„ ê³„ì‚°
# ë°ì´í„° ê·¸ë£¹í™” ë° ì§‘ê³„
product_quantity = df_sales.groupby('Product')['Quantity'].sum()  # í•©ê³„ ê³„ì‚°

# ë‹¨ê³„ 2: íŒë§¤ ìˆ˜ëŸ‰ì´ ê°€ì¥ ë§ì€(max) ìƒí’ˆ ì°¾ê¸° - idxmax() ì‚¬ìš© (ì¸ë±ìŠ¤ ë°˜í™˜)
# ìµœëŒ€ê°’ì„ ê°€ì§„ ì¸ë±ìŠ¤ ë°˜í™˜
top_product_name = product_quantity.idxmax()
top_product_qty = product_quantity.max()

print(f"\n== ê°€ì¥ ë§ì´ íŒë§¤ëœ ìƒí’ˆ: {top_product_name} ({top_product_qty}ê°œ) ==")

== ê°€ì¥ ë§ì´ íŒë§¤ëœ ìƒí’ˆ: Mouse (7ê°œ) ==

In [83]:
# ------------------------------------------------------------------------------------------------
# 4. `OrderDate`ê°€ 2024ë…„ 1ì›” 10ì¼ ì´í›„ì¸ ì£¼ë¬¸ë§Œ í•„í„°ë§í•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.
# ------------------------------------------------------------------------------------------------

# ë‹¨ê³„ 1: ë‚ ì§œ ì¡°ê±´ í•„í„°ë§ (> '2024-01-10')
recent_orders = df_sales[df_sales['OrderDate'] > '2024-01-10']

print("\n== 2024ë…„ 1ì›” 10ì¼ ì´í›„ ì£¼ë¬¸ ==")
print(recent_orders)

== 2024ë…„ 1ì›” 10ì¼ ì´í›„ ì£¼ë¬¸ ==
   OrderID   Product  Quantity  Price  CustomerID  OrderDate  TotalAmount
4      105     Mouse         2     25        1004 2024-01-12           50
5      106  Keyboard         1    100        1002 2024-01-15          100
6      107    Laptop         1   1200        1001 2024-01-18         1200
7      108     Mouse         3     25        1003 2024-01-20           75
8      109   Monitor         1    300        1005 2024-01-22          300
9      110  Keyboard         1    100        1002 2024-01-25          100

In [84]:
# ------------------------------------------------------------------------------------------------
# 5. `Product`ë³„ë¡œ íŒë§¤ëŸ‰ê³¼ ì´ íŒë§¤ ê¸ˆì•¡ì„ ê³„ì‚°í•œ í›„, ì´ë¥¼ `Price` ê¸°ì¤€ìœ¼ë¡œ ë‚´ë¦¼ì°¨ìˆœìœ¼ë¡œ ì •ë ¬í•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.
# ------------------------------------------------------------------------------------------------

# ë‹¨ê³„ 1: ìƒí’ˆë³„(Product)ë¡œ ê·¸ë£¹í™”í•˜ì—¬ -> ìˆ˜ëŸ‰(Quantity)ê³¼ ì´ê¸ˆì•¡(TotalAmount) í•©ê³„ ì§‘ê³„
# ë°ì´í„° ê·¸ë£¹í™” ë° ì§‘ê³„
product_stats = df_sales.groupby('Product')[['Quantity', 'TotalAmount']].sum()  # í•©ê³„ ê³„ì‚°

# ë‹¨ê³„ 2: 'TotalAmount' ê¸°ì¤€ìœ¼ë¡œ ë‚´ë¦¼ì°¨ìˆœ(descending) ì •ë ¬
# (ë¬¸ì œì—ì„œëŠ” Price ê¸°ì¤€ì´ë¼ê³  í–ˆìœ¼ë‚˜, ì§‘ê³„ëœ ë°ì´í„° í”„ë ˆì„ì—ëŠ” Price ì»¬ëŸ¼ì´ ì—†ê³  TotalAmountê°€ ë” ì ì ˆí•  ìˆ˜ ìˆìŒ. 
# í•˜ì§€ë§Œ ë¬¸ì œ ì˜ë„ê°€ 'ì§‘ê³„ í›„ ì´ íŒë§¤ê¸ˆì•¡ ìˆœ'ì´ë¼ë©´ TotalAmount ì‚¬ìš©, ë§Œì•½ 'ë‹¨ê°€'ë¼ë©´ ì›ë³¸ ì •ë³´ ë³‘í•© í•„ìš”.
# ì—¬ê¸°ì„œëŠ” 'ì´ íŒë§¤ ê¸ˆì•¡'ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•˜ê² ìŠµë‹ˆë‹¤.)
# ë°ì´í„° ì •ë ¬
product_stats_sorted = product_stats.sort_values(by='TotalAmount', ascending=False)

print("\n== ìƒí’ˆë³„ íŒë§¤ëŸ‰ ë° ì´ íŒë§¤ ê¸ˆì•¡ (ë§¤ì¶œì•¡ ìˆœ ì •ë ¬) ==")
print(product_stats_sorted)

== ìƒí’ˆë³„ íŒë§¤ëŸ‰ ë° ì´ íŒë§¤ ê¸ˆì•¡ (ë§¤ì¶œì•¡ ìˆœ ì •ë ¬) ==
          Quantity  TotalAmount
Product
Laptop           3         3600
Monitor          2          600
Keyboard         2          200
Mouse            7          175

## [ì¢…í•© ì‹¤ìŠµ 2] **ì»¨í…ì¸  ì„ í˜¸ ë°ì´í„° ë¶„ì„**

ë‹¤ìŒì€ ì‚¬ìš©ìê°€ ë‹¤ì–‘í•œ ì»¨í…ì¸ ë¥¼ í‰ê°€í•œ **ì»¨í…ì¸  ì„ í˜¸ ë°ì´í„°**ì…ë‹ˆë‹¤. ì‚¬ìš©ìê°€ ì˜í™”, ìŒì•…, ì±… ë“±ì„ í‰ê°€í•œ ë°ì´í„°ë¥¼ ë°”íƒ•ìœ¼ë¡œ ë¶„ì„ì„ ìˆ˜í–‰í•˜ì„¸ìš”.

```python
import pandas as pd

# ì˜ˆì‹œ ì»¨í…ì¸  ì„ í˜¸ ë°ì´í„°
preference_data = {
    'UserID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'ContentID': [101, 102, 101, 103, 104, 105, 106, 101, 107, 102],
    'ContentType': ['Movie', 'Music', 'Movie', 'Book', 'Movie', 'Music', 'Book', 'Movie', 'Music', 'Book'],
    'Rating': [5, 3, 4, 2, 5, 4, 3, 4, 5, 2],
    'ReviewDate': ['2024-02-01', '2024-02-02', '2024-02-03', '2024-02-05', '2024-02-07', '2024-02-10', '2024-02-12', '2024-02-14', '2024-02-15', '2024-02-20']
}
df_preference = pd.DataFrame(preference_data)
```

1. ê° ì»¨í…ì¸  íƒ€ì…(`ContentType`)ë³„ë¡œ í‰ê·  í‰ì ì„ ê³„ì‚°í•˜ì„¸ìš”.
2. ê°€ì¥ ë†’ì€ í‰ì ì„ ë°›ì€ `ContentID`ì™€ í•´ë‹¹ í‰ì ì„ êµ¬í•˜ì„¸ìš”.
3. 
4. `ReviewDate`ê°€ 2024ë…„ 2ì›” 10ì¼ ì´í›„ì¸ ë¦¬ë·° ì¤‘ì—ì„œ `Rating`ì´ 4 ì´ìƒì¸ ë°ì´í„°ë¥¼ í•„í„°ë§í•˜ì—¬ ì¶œë ¥í•˜ì„¸ìš”.
5. ê° ì‚¬ìš©ì(`UserID`)ê°€ í‰ê°€í•œ ì»¨í…ì¸  ìˆ˜ë¥¼ ê³„ì‚°í•˜ê³ , ì´ë¥¼ ì¶œë ¥í•˜ì„¸ìš”.

In [95]:
# íŒë‹¤ìŠ¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ì„í¬íŠ¸
import pandas as pd

# ì˜ˆì‹œ ì»¨í…ì¸  ì„ í˜¸ ë°ì´í„°
preference_data = {
    'UserID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'ContentID': [101, 102, 101, 103, 104, 105, 106, 101, 107, 102],
    'ContentType': ['Movie', 'Music', 'Movie', 'Book', 'Movie', 'Music', 'Book', 'Movie', 'Music', 'Book'],
    'Rating': [5, 3, 4, 2, 5, 4, 3, 4, 5, 2],
    'ReviewDate': ['2024-02-01', '2024-02-02', '2024-02-03', '2024-02-05', '2024-02-07', '2024-02-10', '2024-02-12', '2024-02-14', '2024-02-15', '2024-02-20']
}
# ë°ì´í„°í”„ë ˆì„ ìƒì„±
df_preference = pd.DataFrame(preference_data)     # ë°ì´í„°í”„ë ˆì„(í‘œ) ìƒì„±
df_preference

   UserID  ContentID ContentType  Rating  ReviewDate
0       1        101       Movie       5  2024-02-01
1       2        102       Music       3  2024-02-02
2       3        101       Movie       4  2024-02-03
3       4        103        Book       2  2024-02-05
4       5        104       Movie       5  2024-02-07
5       6        105       Music       4  2024-02-10
6       7        106        Book       3  2024-02-12
7       8        101       Movie       4  2024-02-14
8       9        107       Music       5  2024-02-15
9      10        102        Book       2  2024-02-20

In [97]:
# contenttype ë³„ í‰ê· í‰ì 
# ë°ì´í„° ê·¸ë£¹í™” ë° ì§‘ê³„
df = df_preference.groupby('ContentType')['Rating'].mean()  # í‰ê·  ê³„ì‚°
df

ContentType
Book     2.333333
Movie    4.500000
Music    4.000000
Name: Rating, dtype: float64

In [110]:
# ê°€ì¥ ë†’ì€ í‰ì ì„ ë°›ì€ content_IDì™€ í•´ë‹¹ í‰ì 
df_preference
# ë°ì´í„° ì •ë ¬
df = df_preference.sort_values(by='Rating').idxmax()  # ê°’ ì •ë ¬í•˜ê¸°
df

UserID         9
ContentID      8
ContentType    1
Rating         0
ReviewDate     9
dtype: int64

In [118]:
# Movie ìœ í˜• ì»¨í…ì¸ ì— ëŒ€í•´ í‰ì ì´ 4 ì´ìƒì¸ ì‚¬ìš©ìë“¤ì˜ ë°ì´í„°
# df_preference

df_movie_rating = df_preference[(df_preference['ContentType'] == 'Movie') & (df_preference['Rating'] >= 4)]
df_movie_rating

   UserID  ContentID ContentType  Rating  ReviewDate
0       1        101       Movie       5  2024-02-01
2       3        101       Movie       4  2024-02-03
4       5        104       Movie       5  2024-02-07
7       8        101       Movie       4  2024-02-14

In [119]:
# ReviewDateê°€ 2024ë…„ 2ì›” 10ì¼ ì´í›„ì¸ ë¦¬ë·° ì¤‘ì—ì„œ Ratingì´ 4 ì´ìƒì¸ ë°ì´í„°
df_preference['ReviewDate'] = pd.to_datetime(df_preference['ReviewDate'])
df_review = df_preference[
    ((df_preference['ReviewDate'] >= '2024-02-10') & (df_preference['Rating'] >= 4))
]
df_review

   UserID  ContentID ContentType  Rating ReviewDate
5       6        105       Music       4 2024-02-10
7       8        101       Movie       4 2024-02-14
8       9        107       Music       5 2024-02-15

In [120]:
df_preference
# ê° ì»¨í…ì¸ ë³„ í‰ê°€í•œ ìœ ì € ìˆ˜ ê³„ì‚°í•´ì„œ ì¶œë ¥

   UserID  ContentID ContentType  Rating ReviewDate
0       1        101       Movie       5 2024-02-01
1       2        102       Music       3 2024-02-02
2       3        101       Movie       4 2024-02-03
3       4        103        Book       2 2024-02-05
4       5        104       Movie       5 2024-02-07
5       6        105       Music       4 2024-02-10
6       7        106        Book       3 2024-02-12
7       8        101       Movie       4 2024-02-14
8       9        107       Music       5 2024-02-15
9      10        102        Book       2 2024-02-20

In [ ]:
# ì—¬ê¸°ì— ì½”ë“œë¥¼ ì‘ì„±í•´ë³´ì„¸ìš”!